---
kind: other
id: Properties.T:Autodesk.Revit.DB.SpatialElementCalculationLocation
source: html/c798116b-603d-08e1-cab3-88dd9c7256cb.htm
---
# SpatialElementCalculationLocation Properties

The id of the assembly instance to which the element belongs.